#pragma once
#include "MainUpdate.h"



int main(void)
{
	MainUpdate Main;
	Main.Start();

	ULONGLONG Time = GetTickCount64();

	while (true)
	{
		if (Time + 100 <= GetTickCount64())
		{
			Time = GetTickCount64();
			system("cls");

			Main.Update();
			Main.Render();
		}
	}

	return 0;
}



// 비트연산

	// ★플러스 연산★
	//      11 
	// 0000 0010 = 2
	// 0000 0110 = 6
	//---------------
	// 0000 1000 = 8


	// ★마이너스 연산★
	// 뒤에 뺄수를 음수로 반전시키고 + 1 한다음 플러스 연산
	// 양수를 음수, 음수를 양수로 바꾸는법  =  반전시키고 + 1
	//    00000100 4
	//    00000101 5   ->   음수로 반전시킴 + 1   ->   11111011 
	//   
	//    00000100 4
	//    11111011 -5
	//   --------------
	//    11111111 -1 


	//    00000101 5
	//    00000100 4  
	// 
	//    00000101  5
	//    11111100 -4
	// -----------------
	// (1)00000001  1    ->    올라간 1이 끝까지 뒤로 밀리면 ★★★버림★★★