#include <stdio.h>
/***********************
위에는 헤더파일 std스텐다드 i인푼 o아웃풋
#입력한것이 가장 먼저 시작됨
***********************/

int main(void)
{
	/*************************************************************
	★자료형★
    
    8비트 = 1바이트
    1바이트 * 1024 = 1킬로바이트
    1킬로바이트 * 1024 = 1메가바이트
    이후 등등..

    정수 = cpu에서 많이사용
    1, char = 1byte   -128 ~ 127  (아스키코드 표 보면 0~127까지 나와있음 네이버 검색)
    2, short = 2byte   -32768 ~ 32767
    3, int = 4byte     -21억 ~ 21억  (32비트) 
    4, long = 4byte     -21억 ~ 21억

    소수(실수) = gpu에서 많이사용
    1, float = 4byte
    2, double = 8byte

    
    ★연산★
    
    1, 사칙연산 = +, -, *, /, %
	
    2, 대입연산자 = =         ex) a = b 비에값을 에이에 대입한다는 뜻

    3, 논리연산자
    & and연산
    | or연산
    ^ xor연산 (반전연산자)
    ! not연산
    

	***************************************************************/

    /***************************************************************
    
    ★용어★
    
    //한줄 주석, /*여러줄 주석    =   마우스 커서 올렸을때 주석불러오려면 (바로위나 옆에) 주석작성 하면됨
    
    ex)
    //i는 몬스터hp
    int i = 0;
    
    . 닷
    , 콤마
    : 콜론
    ; 세미콜론
    
    문자연산자
    " 문자열
    ' 문자
   
    단항연산자
    * 에스터리스크  =  항목이 하나일때 포인터    두개일때는 곱하기
    & 엠퍼센트  =  항목이 하나일때 주소       두개일때는 논리연산 and

    () 소괄호
    {} 중괄호
    [] 대괄호






    ****************************************************************/
	
    
    return 0;
}
